taurus/test.yml
---
execution:
  - executor: incarne
    scenario: simple
    concurrency: 10
    ramp-up: 30s
    hold-for: 1m

scenarios:
  simple:
    default-address: http://localhost:8070/
    requests:
      - /
      - /gimme404
      - http://localhost/
      - http://127.0.0.1:8070/

services:
  - module: shellexec
    prepare:
      - go build -o bin/incarne cmd/incarne/main.go

modules:
  incarne:
    path: bin/incarne