taurus/test.yml
---
execution:
  - executor: encarno
    scenario: simple
    concurrency: 1000
    throughput: 80000
    ramp-up: 3m
    #steps: 7
    #hold-for: 5m

scenarios:
  simple:
    default-address: http://localhost:8070/
    headers:
      X-Marker: value

    requests: taurus/urls.txt
    requests1:
      - /
      - /gimme404
      - http://127.0.0.1:8070/
      - http://[::1]:8070/
      - http://localhost:8000/

reporting:
  - csvresults

services:
  - module: shellexec
    prepare:
      - go build -o bin/encarno cmd/encarno/main.go

modules:
  encarno:
    path: bin/encarno

  console:
    disable: false