taurus/test.yml
---
execution:
  - executor: incarne
    scenario: simple
    concurrency: 100
    #throughput: 60000
    ramp-up: 5m
    hold-for: 1m

scenarios:
  simple:
    default-address: http://localhost:8070/
    requests:
      - /
      #- /gimme404
      #- http://localhost:8000/
      #- http://127.0.0.1:8000/README.md

reporting:
  - csvresults

services:
  - module: shellexec
    prepare:
      - go build -o bin/incarne cmd/incarne/main.go

modules:
  incarne:
    path: bin/incarne

  console:
    disable: false