taurus/test.yml
---
execution:
  - executor: encarno
    scenario: simple
    concurrency: 10
    throughput: 2000
    ramp-up: 5m
    # steps: 60
    #hold-for: 20s

scenarios:
  simple:
    default-address: https://localhost:8070/
    tls-config:
      insecureskipverify: true
      minversion: 771
      maxversion: 771
      tlsciphersuites:
        - TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA
        - TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA256
        - TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA
        - TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384
        - TLS_RSA_WITH_AES_128_CBC_SHA
        - TLS_RSA_WITH_AES_128_CBC_SHA256
        - TLS_RSA_WITH_AES_128_GCM_SHA256
        - TLS_RSA_WITH_AES_256_CBC_SHA
        - TLS_RSA_WITH_AES_256_GCM_SHA384
    #headers:
    #  X-Marker: value

    requests1: taurus/urls.txt
    requests:
      - /
      #- /gimme404
      #- http://127.0.0.1:8070/
      #- http://[::1]:8070/
      #- http://localhost:8000/bin/encarno
      # - http://192.168.1.254/favicon.ico # my router

    #trace-level: 600

#reporting:
#  - csvresults

services:
  - module: shellexec
    prepare:
      - go build -a -tags netgo -ldflags '-w' -o bin/encarno cmd/encarno/main.go

modules:
  encarno:
    path: bin/encarno

  console:
    disable: false