taurus/test.yml
---
execution:
  - executor: encarno
    scenario: simple
    concurrency: 1
    throughput: 5
    #iterations: 1
    #ramp-up: 5m
    # steps: 60
    hold-for: 5s

scenarios:
  simple:
    protocol: http
    default-address: http://localhost:8070/

    #script: /tmp/1.in
    #requests: taurus/urls.txt
    requests:
      - /
      - /gimme404
      - http://127.0.0.1:8070/
      - http://[::1]:8070/
      #- http://localhost:8000/bin/encarno
      - http://192.168.1.254/favicon.ico # my router
      - http://meo.home/favicon.ico # my router

    trace-level: 600

reporting:
  - csvresults

services:
  - module: shellexec
    prepare:
      - go build -o bin/encarno cmd/encarno/main.go

modules:
  encarno:
    path: bin/encarno
    # output-format: ldjson
    # index-input-strings: false

  console:
    disable: false